In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.neural_network import MLPClassifier
from sklearn.tree import DecisionTreeClassifier
import nan_clean as nc
%matplotlib inline

In [2]:
cd C:\\Users\\Natalia\\Desktop\\udata school\\machine_learning\\Homework

C:\Users\Natalia\Desktop\udata school\machine_learning\Homework

In [3]:
df = pd.read_csv('nba.csv')

In [4]:
df.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [5]:
df["Number"] = df["Number"].astype('object')

In [6]:
df.describe(include=['object'])

,Name,Team,Number,Position,Height,College
count,457,457,457.0,457,457,373
unique,457,30,53.0,5,18,118
top,Darren Collison,New Orleans Pelicans,5.0,SG,6-9,Kentucky
freq,1,19,23.0,102,59,22

In [7]:
df.describe()

              Age      Weight        Salary
count  457.000000  457.000000  4.460000e+02
mean    26.938731  221.522976  4.842684e+06
std      4.404016   26.368343  5.229238e+06
min     19.000000  161.000000  3.088800e+04
25%     24.000000  200.000000  1.044792e+06
50%     26.000000  220.000000  2.839073e+06
75%     30.000000  240.000000  6.500000e+06
max     40.000000  307.000000  2.500000e+07

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null object
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     373 non-null object
Salary      446 non-null float64
dtypes: float64(3), object(6)
memory usage: 32.3+ KB

### NaN to logReg

In [9]:
df = pd.read_csv('nba.csv')
# drop a row with all NaN
df = df[:457]

In [10]:
df = nc.nan_to_logreg(df)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     373 non-null object
Salary      457 non-null float64
dtypes: float64(4), object(5)
memory usage: 32.2+ KB

In [12]:
df['College'] = nc.nan_to_stat(df['College'])

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     457 non-null object
Salary      457 non-null float64
dtypes: float64(4), object(5)
memory usage: 32.2+ KB

In [14]:
targets = df['Position']

In [15]:
numeric = ['Age','Weight', 'Salary']
df_num = df[numeric]

In [16]:
# Split data to train/test sets
X_train, X_test, y_train, y_test = train_test_split(df_num, targets, test_size=0.2, random_state=0)
# Create classifier
dt =   DecisionTreeClassifier(max_depth=5)
# Fit classifier
dt = dt.fit(X_train, y_train)
# Predict on test data
y_pred = dt.predict(X_test)
# Get accuracy score
accuracy_score(y_test, y_pred)

0.4891304347826087

### NaN to median

In [17]:
df = pd.read_csv('nba.csv')
# drop a row with all NaN
df = df[:457]

In [18]:
df = nc.nan_to_stat(df, stat='median')

In [19]:
targets = df['Position']

In [20]:
numeric = ['Age','Weight', 'Salary']
df_num = df[numeric]

In [21]:
# Split data to train/test sets
X_train, X_test, y_train, y_test = train_test_split(df_num, targets, test_size=0.2, random_state=0)
# Create classifier
dt =   DecisionTreeClassifier(max_depth=5)
# Fit classifier
dt = dt.fit(X_train, y_train)
# Predict on test data
y_pred = dt.predict(X_test)
# Get accuracy score
accuracy_score(y_test, y_pred)

0.5108695652173914

### В данном эксперименте более точный результат дал метод с медианой

### KNN

In [22]:
df = pd.read_csv('nba.csv')
# drop a row with all NaN
df = df[:457]

In [23]:
targets = df["Position"]

In [24]:
numeric = ['Age','Weight', 'Salary']
df_num = df[numeric]
nans = [j[0] for j in nc.nan_detect(df)]
df_without_nan = df_num.drop(nans)
target_without_nan = targets.drop(nans)

In [25]:
x_train, x_test, y_train, y_test = train_test_split(df_without_nan, target_without_nan, test_size=0.2, random_state=0)

In [26]:
y_pred = nc.knn(x_train, x_test, y_train, y_test, 10)

In [27]:
accuracy_score(y_test,y_pred)

0.273972602739726